<a href="https://colab.research.google.com/github/Data-Intelligence-Mastery/data_science_interview_questions/blob/master/Q016_SQL_patterns.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## SQL patterns
`SQL Database, Querying`

Suppose you're given the following table, called 'employees':


name | job_role
--- | ---
John	| Analyst
Harry	| Administrative Business Partner
Sam	| Software Engineer
Tina |	Analyst


To test your SQL skills, create a query that returns the name and job_role of each individual who has either a name that contains the letter 'a' or a job role that ends in the letters 'er'.

In [32]:
import pandas as pd

employees = {'name': ['John', 'Harry', 'Sam', 'Tina'], 'job_role': ['Analyst', 'Administrative Business Partner', 'Software Engineer', 'Analyst']}
employees = pd.DataFrame(employees)

from tabulate import tabulate as tb
print(tb(employees, headers='keys', tablefmt='pretty'))

+---+-------+---------------------------------+
|   | name  |            job_role             |
+---+-------+---------------------------------+
| 0 | John  |             Analyst             |
| 1 | Harry | Administrative Business Partner |
| 2 |  Sam  |        Software Engineer        |
| 3 | Tina  |             Analyst             |
+---+-------+---------------------------------+

In [4]:
import sqlite3

conn = sqlite3.connect('employees.db')
c = conn.cursor()

c.execute('CREATE TABLE employees (name, job_role)')
conn.commit()

employees.to_sql('employees', conn, if_exists = 'replace', index=True)
c.execute(''' SELECT * FROM employees ''')

for row in c.fetchall():
  print(row)

(0, 'John', 'Analyst')
(1, 'Harry', 'Administrative Business Partner')
(2, 'Sam', 'Software Engineer')
(3, 'Tina', 'Analyst')

In [30]:
c.execute(''' SELECT * FROM employees
          WHERE job_role LIKE '%er' 
          AND name LIKE '%a%' ''')

for row in c.fetchall():
  print(row)

(1, 'Harry', 'Administrative Business Partner')
(2, 'Sam', 'Software Engineer')

The `LIKE` pattern matching operator can also be used in the conditional selection of the where clause. Like is a very powerful operator that allows you to select only rows that are "like" what you specify. The percent sign "%" can be used as a wild card to match any possible character that might appear before or after the characters specified ([reference](http://www.sqlcourse.com/select.html)).